{
  "CryptoPulse": {
    "title": "Crypto Pulse",
    "deployedLink": "https://cryptopulseapp.netlify.app/",
    "githubLink": "https://github.com/abduelamin/CryptoPulse",
    "image": "cryptopulseapp.png",
    "description": "Discover real-time cryptocurrency prices with our app. Track top movers, explore the top 20 coins by market cap, and dive into detailed coin info and charts. Stay informed and make smart decisions in the dynamic world of digital currencies."
  },
  "StudyBuddy": {
    "title": "Study Buddy",
    "deployedLink": "https://studybuddy-ai.netlify.app/",
    "githubLink": "https://github.com/abduelamin/Study-Buddy",
    "image": "aibot.png",
    "description": " Introducing StudyBuddy– a revolutionary AI-powered chatbot tailored exclusively to cater to your web development queries and curiosities. Crafted meticulously from the ground up, StudyBuddy is more than just a digital assistant; it's your personal guide through the vast realm of web development knowledge."
  },
  "CartSwipe": {
    "title": "Cart Swipe",
    "deployedLink": "https://cartswipe.netlify.app/",
    "githubLink": "https://github.com/abduelamin/CartSwipe",
    "image": "cartswpe-Screenshot.png",
    "description": "Introducing CartSwipe – an immersive e-commerce platform that elevates online shopping to an engaging experience. Seamlessly integrating React.js, React Hook Form, and JWT authentication, CartSwipe ensures smooth user interactions while showcasing the dynamic synergy of frontend and backend technologies. Welcome to a world where shopping online isn't just a transaction but an interactive journey into the world of modern retail."
  },

  "DreamNestTravel": {
    "title": "Dream Nest Travel",
    "deployedLink": "https://dream-travel-five.vercel.app/",
    "githubLink": "https://github.com/abduelamin/DreamTravel",
    "image": "dreamnest.png",
    "description": "Dream Nest Travel is a full-stack rental platform built with React, Node.js, Express, PostgreSQL, and Tailwind CSS. Users can create profiles, list properties, make bookings, and manage their wishlist. AWS services are used for image uploads and storage, providing a seamless experience for hosts and travelers alike"
  }
}
